{"config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "conv2d_10", "padding": "valid", "activity_regularizer": null, "filters": 32, "batch_input_shape": [null, 64, 64, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "dtype": "float32", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_10", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_11", "padding": "valid", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_11", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_12", "padding": "valid", "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_12", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "dense_9", "activity_regularizer": null, "units": 64, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "softmax", "use_bias": true, "name": "dense_10", "activity_regularizer": null, "units": 30, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow"}