{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_6", "kernel_constraint": null, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_6"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_7", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_7"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_8", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_8"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "units": 32, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "units": 10, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "activity_regularizer": null}}]}
